{
    "basics": {
      "name": "Ethan Grinberg",
      "label": "Software Developer",
      "profile_pic": "profile.jpg",
      "image": "cover-image.png",
      "email": "ethanbg2@illinois.edu",
      "url": "https://ethangrinberg.netlify.app/",
      "resume_url": "https://docs.google.com/document/d/1hI4xo5BDCiqm8rjPqlC2n26F9glB9UkavpYrbu4yO-s/export?format=pdf",
      "summary": "Full Stack Developer, Data Scientist, and Researcher",
      "bio": "I like creating digital stuff",
      "profiles": [{
        "network": "GitHub",
        "url": "https://github.com/ethanbg2"
      },
      {
        "network": "LinkedIn",
        "url": "https://www.linkedin.com/in/ethangrinberg"
      }]
    },
    "work": [{
      "company": "Media and Advertising Lab UIUC",
      "position": "Undergraduate Research Assistant",
      "date": "May 2021 - Aug 2022",
      "description": "As an Undergraduate Research Assistant at the Media and Advertising Lab at the University of Illinois Urbana-Champaign, I provided crucial support to a range of research projects by contributing my skills in data processing, analysis, and visualization.",
      "contributions": [
        "Successfully developed and implemented Python algorithms for extracting attention metrics from high-dimensional mobile phone log data, resulting in deeper understanding of participants' behavior",
        "Conducted advanced time series sentiment analysis of movie scripts using state-of-the-art natural language processing tools (Spacy, NLTK) and machine learning techniques (Sklearn) resulting in new understanding of movie story structure",
        "Created key data visualizations and analyses in Python, Pandas, Altair for research paper accepted to ICA conference in Paris, France",
        "Utilized BS4 and Selenium in developing web scrapers, resulting in a significant time-saving and improved accuracy of data collection for analyses"
      ],
      "skills": [
        "Python",
        "Pandas",
        "Numpy",
        "Selenium",
        "BS4",
        "Spacy",
        "NLTK",
        "Networkx",
        "Altair",
        "Matplotlib",
        "Scipy",
        "Sklearn",
        "Zotero"
      ],
      "projects": [
      ],
      "links": [
        {
          "text": "MAD Lab Website",
          "url": "https://madlabresearch.web.illinois.edu/"
        },
        {
          "text": "MUSE Lab Website",
          "url": "https://museresearch.github.io/"
        }
      ]
    },
    {
      "company": "Information and Intelligence Group UIUC",
      "position": "Undergraduate Research Assistant",
      "date": "May 2022 - Aug 2022",
      "description": "As an undergraduate research assistant at the Information and Intelligence Group, I used multi-agent reinforcement learning to experiment with different policies for improving the health of social media platforms. Specifically, I developed and tested various algorithms for modeling the interactions between users and the platform, with the goal of maximizing key metrics such as user engagement and satisfaction while minimizing negative outcomes such as spam and disinformation. Overall, this experience gave me valuable insights into the application of reinforcement learning to complex social systems, and I believe my findings could have broader implications for the design of online communities and platforms.",
      "contributions": [
        "Developed Markov decision process to model decision-making in social media environment",
        "Created multi-agent environment in Python to extend an existing economic simulation framework",
        "Implemented PPO deep reinforcement learning algorithm using RLlib and Tensorflow to train agents to make optimal decisions in multi-agent environment",
        "Applied trained models to evaluate different policies and strategies for improving health and performance of social media platforms"
      ],
      "skills": [
        "Python",
        "RLlib",
        "TensorFlow"
      ],
      "projects": [
      ],
      "links": [
        {
          "text": "Lab Website",
          "url": "https://publish.illinois.edu/varshney/"
        }
      ]
    }],
    "education": [{
      "title": "University of Illinois at Urbana-Champaign (UIUC)",
      "description": "2020 - 2024, Bachelor of Science in Computer Science and Advertising, GPA: 4.0"
    }],
    "awards": [{
      "title": "Outstanding Poster Presentation Undergraduate Research Symposium",
      "description": "Received Outstanding Poster Presentation in Numbers, Data, and Computation at the 2022 Undergraduate Research Symposium for my work on machine learning and misinformation"
    },
    {
      "title": "Image of Research Semi-Finalist",
      "description": "My data visualization of misinformation was displayed at the Undergraduate Research Symposium in 2022"
    },
    {
      "title": "Provost Scholarship",
      "description": "Full tuition scholarship given to the top 20 incoming freshman at UIUC"
    },
    {
      "title": "James Scholar",
      "description": "Top 20% of admitted freshman class. Requires keeping a GPA of 3.5 and completing an honors project every year."
    },
    {
      "title": "Pens to Lens",
      "description": "Wrote a short film screenplay that was selected to be made into a film and shown at a local movie theater"
    },
    {
      "title": "Film Festivals",
      "description": "Accepted to the following film festivals: All American High school Film Festival, Middle Coast Film Festival, Catlow Film Festival, Shawnee Shorts Midwestern Film Festival, Prairie State Film Festival"
    }
  ],
    "publications": [{
      "title": "The shape of inspiration: Exploring the narrative story trajectories and self-transcendent elicitors within inspirational movies",
      "description": "Dale, K., Fisher, J.T., Liao, J., & Grinberg, E. (2022). The shape of inspiration: Exploring the narrative story trajectories and self-transcendent elicitors within inspirational movies. Paper submitted to the 22nd annual meeting of the International Communication Association (Paris, FR)."
    }],
    "projects": [
  {
      "name": "Mechanisms of Misinformation",
      "type": "Data Science",
      "description": "The radical change social media has brought to our information ecosystem has created one of the biggest problems our world faces today: misinformation. With economic, social, and political implications, researchers have directed their attention to ways in which this problem can be understood and solved. Recent work has shown that articles from misleading sources can be told apart from mainstream sources by the topology of their Twitter diffusion networks. This project expands on these findings by attempting to answer the question: can the diffusion networks of misinformation articles reveal a set of ways in which misinformation spreads on social media? To accomplish this, the Twitter diffusion networks of over 700 articles from low credibility sources were converted to embeddings using the UGraphEmb graph embedding algorithm and clustered using k-means clustering. From here the differences in topological features of diffusion networks belonging to different clusters will be analyzed and explained. The hope is to use these results to better inform social media policy and algorithm design. ",
      "date": "Jan 2022 - Aug 2022",
      "skills": [
        "Python",
        "Altair",
        "Pandas",
        "Numpy",
        "Networkx",
        "TensorFlow",
        "Pytorch",
        "Sklearn",
        "InDesign"
      ],
      "images": [
        "misinfo_viz.jpeg",
        "presenting.jpg",
        "poster.jpeg"
      ],
      "contributions": [
        "task 1",
        "task 2",
        "task 3"
      ],
      "links": [
        {
          "text": "GitHub",
          "url": "https://github.com/ethanbg2/misinformation-cluster-analysis"
        },
        {
          "text": "Poster",
          "url": "https://github.com/ethanbg2/misinformation-cluster-analysis/blob/master/reports/poster/ug_symposium_poster_2022.pdf"
        },
        {
          "text": "Poster Presentation Award",
          "url": "https://blogs.illinois.edu/view/6204/678500770"
        },
        {
          "text": "College Blog Post",
          "url": "https://media.illinois.edu/media-students-present-2022-undergraduate-research-symposium"
        },
        {
          "text": "Image of Research",
          "url": "https://publish.illinois.edu/imageofresearch/undergraduate-image-of-research/2022-undergraduate-entries/"
        }
      ]
  },
  {
      "name": "Product Cupid",
      "type": "Web App",
      "description": "People love personalized recommendations but are weary of the privacy they give up to get them. This project aims to reconcile both of these seemingly opposite desires. By creating a recommendation system that only relies on volunteered user preferences, the hope is to show that it is possible to create a privacy-first recommendation system. This project is still under development, namely the AI recommendation algorithm, but so far a simple proof of concept was built.",
      "date": "Aug 2022 - Present",
      "skills": [
        "Python",
        "Javascript",
        "React.js",
        "Flask",
        "Microservice Architecture",
        "Heroku",
        "REST APIs",
        "CI/CD",
        "Material UI",
        "Agile",
        "Figma"
      ],
      "images": [
        "product_cupid.png",
        "product_cupid2.png",
        "product_cupid3.png"
      ],
      "contributions": [
        "Led development of full stack product recommendation app that used gamification techniques to enhance user experience of searching for products",
        "Developed Flask-based REST backend to manage product data and feed product recommendations to frontend",
        "Created dynamic and responsive frontend using React.js, Material UI, and Javascript for real-time data updates through HTTP requests to backend",
        "Created continuous integration and deployment (CI/CD) pipeline using Github and Heroku to streamline development process and ensure seamless user experience"
      ],
      "links": [
        {
          "text": "Web App",
          "url": "https://product-cupid.herokuapp.com"
        },
        {
          "text": "GitHub",
          "url": "https://github.com/ethanbg2/product-cupid"
        }, 
        {
          "text": "Project Website",
          "url": "https://sites.google.com/illinois.edu/productcupid"
        }, 
        {
          "text": "Figma Design",
          "url": "https://www.figma.com/proto/5Y67kWgH6rkzHOz9cBtuDQ/Final-draft?node-id=120%3A131&source=email_invite&starting-point-node-id=120%3A131"
        },
        {
          "text": "Final Report",
          "url": "https://drive.google.com/file/d/17gkqg65eWS8lhOFFxEMIY4zjLOCbIRJw/view?usp=sharing"
        }
      ]
    }],
    "courses": [
      {
        "name": "Data Structures",
        "skills": [
          "C++",
          "Object Oriented Design",
          "Catch2"
        ]
      },
      {
        "name": "Algorithms",
        "skills": []
      },
      {
        "name": "Systems Programming",
        "skills": [
          "C",
          "Flask",
          "Redis",
          "Python",
          "Microservice Architecture",
          "AWS S3",
          "Docker",
          "REST APIs",
          "Multi-Threading",
          "Pytest"
        ]
      },
      {
        "name": "Software Design",
        "skills": [
          "Object Oriented Design",
          "C++",
          "Java",
          "Catch2"
        ]
      },
      {
        "name": "Probability/Statistics",
        "skills": [
          "Python",
          "Sklearn",
          "Numpy",
          "Pandas",
          "PyTorch",
          "Matplotlib"
        ]
      },
      {
        "name": "Linear Algebra",
        "skills": [
          "Python",
          "Sklearn",
          "Numpy",
          "Pandas",
          "Matplotlib"
        ]
      },
      {
        "name": "Tech/Advertising",
        "skills": []
      },
      {
        "name": "Research Methods",
        "skills": []
      }
    ]
  }